# DS-SF-36 | 04 | Databases and Scrapping | Assignment | Starter Code

## `SQLite` and Bistro

In this assignment, we will be exploring the `bistro` dataset.  The previous assignment used `pandas`.  Today, we'll answer the same questions but using `SQLite`.  In some situations, `pandas` will be a better solution.  In others, doing it using `SQL` will make more sense.  As you gain more experience, you'll know which one to use.

> ### Question 1.  Import the `sqlite3` package.

In [11]:
import os

import pandas as pd
pd.set_option('display.max_rows', 10)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)

import sqlite3

> ### Question 2.  Connect to the `dataset-04-bistro.db` database.  The rest of this assignment focus on the `bistro` table.

In [13]:
db = sqlite3.connect(os.path.join('..','datasets','dataset-04-bistro.db'))

> ### Question 3.  How many samples (i.e., rows) are in this dataset?

In [15]:
pd.io.sql.read_sql(''' select count(*) as count from bistro;''',con = db)

   count
0    244

Answer: TODO

> ### Question 4.  Print the first two rows of the table to the console.

In [18]:
pd.io.sql.read_sql(''' select *  from bistro LIMIT 2 ; ''',con = db)

   index     day    time      name  gender  is_smoker  party  check   tip
0      0  Sunday  Dinner  Kimberly  Female          0      2  16.99  1.01
1      1  Sunday  Dinner  Nicholas    Male          0      3  10.34  1.66

> ### Question 5.  For which week days does the dataset has data for?

In [21]:
pd.io.sql.read_sql(''' select Distinct day from bistro where day!='NULL'; ''',con = db)

        day
0    Sunday
1  Saturday
2  Thursday
3    Friday

Answer: TODO

> ### Question 6.  How often was the bistro patronized for each week day?

In [31]:
pd.io.sql.read_sql('''  select count(tip) as totalvisits,day from bistro group by day ; ''',con = db)

   totalvisits       day
0           19    Friday
1           87  Saturday
2           76    Sunday
3           62  Thursday

Answer: TODO

> ### Question 7.  How much tip did waiters collect for each week day?

In [38]:
pd.io.sql.read_sql(''' select sum(tip),day from bistro group by day ; ''',con = db)

   sum(tip)       day
0     51.96    Friday
1    260.40  Saturday
2    247.39    Sunday
3    171.83  Thursday

Answer: TODO

> ### Question 8.  What is the average tip per check (in absolute \$) for each week day?

In [40]:
pd.io.sql.read_sql(''' select avg(tip) as Mean_Tip from bistro group by day; ''',con = db)

   Mean_Tip
0  2.734737
1  2.993103
2  3.255132
3  2.771452

Answer: TODO

> ### Question 9.  What is the average tip per check (as a percentage of the check) for each week day?

(`CHECK` is a reserved keywork; use `` `check` `` (put the name between backticks) to reference the `check` column)

In [50]:
pd.io.sql.read_sql(''' select day,(sum(tip)/sum(`check`)*100) as percentage from bistro group by day  ; ''',con = db)

        day  percentage
0    Friday   15.944519
1  Saturday   14.642375
2    Sunday   15.203791
3  Thursday   15.673201

Answer: TODO

> ### Question 10.  Are there any name in common between male and female patrons?  (E.g., `Chris` can refer to either a man or a woman)

In [78]:
pd.io.sql.read_sql('''select name from bistro ''',con = db)

         name
0    Kimberly
1    Nicholas
2       Larry
3      Joseph
4      Janice
..        ...
239     Kevin
240    Sandra
241      Carl
242       Jon
243    Brandi

[244 rows x 1 columns]

Answer: TODO

> ### Question 11.  If no patrons share the same name, how many unique patrons are in the dataset?

In [53]:
pd.io.sql.read_sql('''select count(Distinct(name)) from bistro  ; ''',con = db)

   count(Distinct(name))
0                    181

Answer: TODO

> ### Question 12.  How many times did `Kevin` patronized the bistro?  How about `Alice`?

In [87]:
pd.io.sql.read_sql('''select count(*) from bistro where name ='Kevin'
''',con = db)

   count(*)
0         4

In [88]:
pd.io.sql.read_sql('''select count(*) from bistro where name ='Alice'
''',con = db)

   count(*)
0         2

Answer: TODO

> ### Question 13.  Who are the top 3 female and male patrons?

In [140]:
pd.io.sql.read_sql(''' 
select name ,count(*) as c  from bistro where gender = 'Male' group by name order by c DESC limit 3
;
''',con = db)# TODO

    name  c
0  David  8
1  Casey  5
2  James  5

Answer: TODO

In [142]:
pd.io.sql.read_sql(''' 
select name ,count(*) as c  from bistro where gender = 'Female' group by name order by c DESC limit 3
;
''',con = db)

    name  c
0   Mary  4
1  Casey  3
2  Laura  3

> ### Question 14.  Who's the best tipper (as a fraction of all tips over all check totals)?  Who's the worst?  How many times did they patronize the bistro?

In [150]:
pd.io.sql.read_sql(''' 
select name ,(sum(tip)/sum(`check`))as bestTipper ,count()  from bistro  group by name order by bestTipper DESC limit 1
;
''',con = db)

      name  bestTipper  count()
0  Maryann    0.416667        1

In [149]:
pd.io.sql.read_sql(''' 
select name ,(sum(tip)/sum(`check`)) as bestTipper,count()   from bistro  group by name order by bestTipper ASC limit 1
;
''',con = db)

     name  bestTipper  count()
0  Jeremy    0.035638        1

Answer: TODO